"tools": [
    {
        "friendly_name": "Python REPL Tool",
        "description": "A Python shell. Use this to execute python commands. Input should be a valid python command. If you want to see the output of a value, you should print it out with `print(...)`.",
        "tool_module_name": "ai.agent_tools.python_repl",
        "tool_class_name": "PythonREPLTool"
    },
    {
        "friendly_name": "Date / Time Tool",
        "description": "A tool used to get the current date and time.  Input is a time zone, in the format expected by the python pytz.timezone() call. Use the Python REPL Tool to get a list of valid time zones before calling this tool.",
        "tool_module_name": "ai.agent_tools.time_tool",
        "tool_class_name": "TimeTool"
    },
    {
        "friendly_name": "Wikipedia Tool",
        "description": "A tool that is useful for looking things up on wikipedia.",
        "tool_module_name": "ai.agent_tools.wikipedia_tool",
        "tool_class_name": "WikipediaTool",
        "arguments": {
            "top_k_results": 1,
            "doc_content_chars_max": 2000
        }
    },
    {
        "friendly_name": "DuckDuckGo Search Tool",
        "description": "A tool that is useful for searching for things on the internet, this tool should be used when the answer to a user's query cannot be found with other tools or by your own knowledge.",
        "tool_module_name": "ai.agent_tools.duck_duck_go_tool",
        "tool_class_name": "DuckDuckGoTool"
    },                
    {
        "friendly_name": "Available Calendars Tool",
        "description": "A tool that is useful for listing all of the available calendars a user has access to.  Use this tool to find the correct 'calendar_id'.  Always use this tool before the Calendar Events Tool.",
        "tool_module_name": "ai.agent_tools.list_calendars_tool",
        "tool_class_name": "ListCalendarsTool"
    },
    {
        "friendly_name": "Calendar Events Tool",
        "description": "USE THE AVAILABLE CALENDARS TOOL FIRST!! A tool for getting events from a calendar. Always use the output from the Available Calendars Tool to find the 'calendar_id' for this tool.  The input must contain a 'calendar_id' key found by using the Available Calendars Tool, a 'start_date' key, and an 'end_date' key.  Think about the context of the user's request, and pick the right 'calendar_id' from the available calendars.  If no date range is specified, 'start_date' and 'end_date' should be the same.  The dates should be a string in the format YYYY-MM-DD.  The input must be a single JSON string",
        "tool_module_name": "ai.agent_tools.calendar_events_tool",
        "tool_class_name": "CalendarEventsTool"
    },
    {
        "friendly_name": "Weather Tool",
        "description": "A tool that is useful for getting the weather for a specific location.  Input should be a single JSON string, containing a 'location' key, and a 'date' key.  The location should be a string, and the date should be a string in the format YYYY-MM-DD.  If no date is specified, the current date will be used.",
        "tool_module_name": "ai.agent_tools.weather_tool",
        "tool_class_name": "WeatherTool"
    },
    {
        "friendly_name": "Self-Settings Lookup Tool",
        "description": "Use this tool to look up the settings that are available to you.  The output of this tool is a JSON object that contains all of the settings that you can modify, and their current values.",
        "tool_module_name": "ai.agent_tools.self_settings_lookup_tool",
        "tool_class_name": "SelfSettingsLookupTool"
    },
    {
        "friendly_name": "Self-Settings Tool",
        "description": "Useful if you are asked to change anything about yourself, or when the user asks to change settings.  You must use the output of the 'Self-Settings Lookup Tool' for the input to this tool. Single setting example: 'setting_name_from_lookup_tool=setting_value'. Multiple settings example: 'setting_name_from_lookup_tool=setting_value, volume=7,my_name='its me''. The setting name should be one of the settings from the Self-Settings Lookup Tool.",
        "tool_module_name": "ai.agent_tools.self_settings_tool",
        "tool_class_name": "SelfSettingsTool"
    }
]